In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("Decision_Tree_dataset.csv")

In [3]:
data

       company                  job     degree  salary_more_then_50000
0     Reliance      sales executive  bachelors                       0
1     Reliance      sales executive    masters                       0
2     Reliance     business manager  bachelors                       1
3     Reliance     business manager    masters                       1
4     Reliance  computer programmer  bachelors                       0
5     Reliance  computer programmer    masters                       1
6      Torrent      sales executive    masters                       0
7      Torrent  computer programmer  bachelors                       0
8      Torrent     business manager  bachelors                       0
9      Torrent     business manager    masters                       1
10  Sun Pharma      sales executive  bachelors                       1
11  Sun Pharma      sales executive    masters                       1
12  Sun Pharma     business manager  bachelors                       1
13  Sun Pharma     business manager    masters                       1
14  Sun Pharma  computer programmer  bachelors                       1
15  Sun Pharma  computer programmer    masters                       1

In [4]:
target = data['salary_more_then_50000']

In [5]:
inputs = data.drop('salary_more_then_50000',axis='columns')

In [6]:
inputs.head()

    company                  job     degree
0  Reliance      sales executive  bachelors
1  Reliance      sales executive    masters
2  Reliance     business manager  bachelors
3  Reliance     business manager    masters
4  Reliance  computer programmer  bachelors

In [7]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [8]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

# Decode

inputs['degree_n'] = le_degree.inverse_transform(inputs['degree_n'])

In [9]:
inputs

       company                  job     degree  company_n  job_n  degree_n
0     Reliance      sales executive  bachelors          0      2         0
1     Reliance      sales executive    masters          0      2         1
2     Reliance     business manager  bachelors          0      0         0
3     Reliance     business manager    masters          0      0         1
4     Reliance  computer programmer  bachelors          0      1         0
5     Reliance  computer programmer    masters          0      1         1
6      Torrent      sales executive    masters          2      2         1
7      Torrent  computer programmer  bachelors          2      1         0
8      Torrent     business manager  bachelors          2      0         0
9      Torrent     business manager    masters          2      0         1
10  Sun Pharma      sales executive  bachelors          1      2         0
11  Sun Pharma      sales executive    masters          1      2         1
12  Sun Pharma     business manager  bachelors          1      0         0
13  Sun Pharma     business manager    masters          1      0         1
14  Sun Pharma  computer programmer  bachelors          1      1         0
15  Sun Pharma  computer programmer    masters          1      1         1

In [10]:
inputs_n = inputs.drop(['company','job','degree'],axis='columns')

In [11]:
inputs_n

    company_n  job_n  degree_n
0           0      2         0
1           0      2         1
2           0      0         0
3           0      0         1
4           0      1         0
5           0      1         1
6           2      2         1
7           2      1         0
8           2      0         0
9           2      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [12]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_50000, dtype: int64

# Random Forest Classification

Random dataset gets selected and prepare multiple decision tree

In [13]:
#Import Random Forest Model
from sklearn.ensemble import RandomForestClassifier

In [14]:
Model=RandomForestClassifier(n_estimators=100)

In [15]:
Model.fit(inputs_n, target)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [16]:
Model.score(inputs_n,target)

1.0

In [19]:
prediction_data=Model.predict(inputs_n)

In [20]:
prediction_data

array([0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1], dtype=int64)

In [22]:
# confusion matrix,accuracy,classification_report in sklearn
from sklearn.metrics import confusion_matrix 
from sklearn.metrics import accuracy_score 
from sklearn.metrics import classification_report

In [23]:
# confusion matrix
matrix = confusion_matrix(target,prediction_data, labels=[1,0])
print('Confusion matrix : \n',matrix)

Confusion matrix :
 [[10  0]
 [ 0  6]]

In [25]:
accuracy = accuracy_score(target, prediction_data)

In [26]:
accuracy_percentage = 100 * accuracy
accuracy_percentage

100.0